run/microchannel/system/blockMeshDictOld
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
/*    (-0.5 -15   0)
    ( 0.5 -15   0)
    ( 0.5  15   0)
    (-0.5  15   0)
    (-0.5 -15 110)
    ( 0.5 -15 110)
    ( 0.5  15 110)
    (-0.5  15 110)
*/

(0 0 0)
(10 0 0)
(10 1.14e-0 0)
(0 1.14e-0 0)
(0 0 0.2)
(10 0 0.2)
(10 1.14e-0 0.2)
(0 1.14e-0 0.2)

);

blocks
(
    //hex (0 1 2 3 4 5 6 7) (1 15 45) simpleGrading (1 1 1)
    hex (0 1 2 3 4 5 6 7) (300 500 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }

    top
    {
        type wall;
        faces
        (
            (3 2 6 7)            
        );
    }

    bottom
    {
        type symmetry;
        faces
        (
            (0 4 5 1)            
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (7 6 5 4)
        );
    }
);

// ************************************************************************* //
